tap "buildkite/buildkite"
tap "buildkite/cli"
tap "chef/chef"
tap "cloudflare/cloudflare"
tap "codeclimate/formulae"
tap "dbt-labs/dbt"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "puma/puma"
brew "ack"
brew "adns"
brew "adr-tools"
brew "openssl@3"
brew "libyaml"
brew "readline"
brew "sqlite"
brew "xz"
brew "ansible"
brew "ansifilter"
brew "jpeg-turbo"
brew "libpng"
brew "libtiff"
brew "webp"
brew "apr"
brew "apr-util"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "gmp"
brew "coreutils"
brew "libtool"
brew "unixodbc"
brew "asdf"
brew "aspell"
brew "snappy"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "lzo"
brew "pixman"
brew "cairo"
brew "graphite2"
brew "harfbuzz"
brew "avro-tools"
brew "awk"
brew "aws-shell"
brew "python@3.11"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bats-core"
brew "bazaar"
brew "bc"
brew "bdw-gc"
brew "berkeley-db"
brew "bfg"
brew "bison"
brew "bison@2.7"
brew "boost"
brew "boot-clj"
brew "brew-pip"
brew "bsdmake"
brew "bzip2"
brew "ghc"
brew "cabal-install"
brew "caddy"
brew "cassandra"
brew "cayley"
brew "chruby"
brew "circleci"
brew "cloc"
brew "isl"
brew "cloog"
brew "libuv"
brew "node"
brew "cloudflare-wrangler2"
brew "cmake"
brew "codecov-cli"
brew "colordiff"
brew "pcre"
brew "comby"
brew "libunistring"
brew "libssh2"
brew "curl"
brew "gd"
brew "libsodium"
brew "oniguruma"
brew "php"
brew "composer"
brew "confuse"
brew "consul"
brew "container-diff"
brew "container-structure-test"
brew "cosign"
brew "cowsay"
brew "cpanminus"
brew "libevent"
brew "pkg-config"
brew "crystal"
brew "cscope"
brew "ctags"
brew "diffstat"
brew "diffutils"
brew "docker-completion"
brew "docker-credential-helper"
brew "docker-machine"
brew "dos2unix"
brew "ec2-ami-tools"
brew "ec2-api-tools"
brew "ed"
brew "wxwidgets"
brew "erlang"
brew "elixir"
brew "elm"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "enchant"
brew "exercism"
brew "openssl@1.1"
brew "expect"
brew "faac"
brew "lame"
brew "libarchive"
brew "libass"
brew "pango"
brew "sdl2"
brew "tesseract"
brew "x264"
brew "xvid"
brew "ffmpeg"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "figlet"
brew "libmagic"
brew "file-formula"
brew "filebeat"
brew "findutils"
brew "flex"
brew "fltk"
brew "fop"
brew "fortune"
brew "fwup"
brew "gdbm"
brew "gdk-pixbuf"
brew "go"
brew "gdm"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "glew"
brew "glm"
brew "gnu-tar"
brew "gnu-typist"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "gobject-introspection"
brew "gotags"
brew "gpatch"
brew "gperftools"
brew "gradle"
brew "jasper"
brew "graphicsmagick"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "psutils"
brew "groff"
brew "msgpack"
brew "groovy"
brew "gzip"
brew "haproxy"
brew "haskell-stack"
brew "helm"
brew "hiredis"
brew "htop"
brew "httpie"
brew "shared-mime-info"
brew "libheif"
brew "libffi"
brew "python@3.9"
brew "libraw"
brew "imagemagick"
brew "jemalloc"
brew "jpeg"
brew "jq"
brew "json-c"
brew "zookeeper"
brew "kafka"
brew "yajl"
brew "kcat"
brew "kubernetes-cli"
brew "kops"
brew "kubeval"
brew "lbzip2"
brew "leiningen"
brew "less"
brew "libcroco"
brew "libfido2"
brew "libgit2"
brew "libmemcached"
brew "libpqxx"
brew "unibilium"
brew "libtermkey"
brew "libusb-compat"
brew "libvo-aacenc"
brew "libvterm"
brew "libxslt"
brew "libyubikey"
brew "ruby"
brew "licensed"
brew "links"
brew "popt"
brew "logrotate"
brew "lsof"
brew "lua"
brew "lynx"
brew "mad"
brew "make"
brew "mariadb"
brew "markdownlint-cli"
brew "mas"
brew "maven"
brew "mhash"
brew "mcrypt"
brew "memcached"
brew "mercurial"
brew "meson"
brew "minikube"
brew "protobuf"
brew "mitmproxy"
brew "mongosh"
brew "mosh"
brew "zlib"
brew "mysql-client"
brew "nagios-plugins"
brew "nagios"
brew "nano"
brew "nasm"
brew "neovim"
brew "nginx"
brew "nvm"
brew "openapi-generator"
brew "openblas"
brew "ossp-uuid"
brew "overarch"
brew "utf8proc"
brew "tmux"
brew "overmind"
brew "p7zip"
brew "packer"
brew "ykclient"
brew "ykpers"
brew "pam_yubico"
brew "passenger"
brew "perl"
brew "perl@5.18"
brew "pgbouncer"
brew "pinentry-mac"
brew "plantuml"
brew "pnpm"
brew "poppler"
brew "postgresql@12"
brew "postgresql@14"
brew "postgresql@16", restart_service: true
brew "proctools"
brew "pth"
brew "pv"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "qemu"
brew "qt"
brew "r"
brew "rabbitmq"
brew "rbspy"
brew "re2c"
brew "reattach-to-user-namespace"
brew "rebar3"
brew "redis", restart_service: true
brew "rethinkdb"
brew "rpm"
brew "rsync"
brew "ruby-install"
brew "s3cmd"
brew "sassc"
brew "sbt"
brew "scons"
brew "screen"
brew "sdl12-compat"
brew "sdl2_image"
brew "sdl_image"
brew "serf"
brew "shellcheck"
brew "socat"
brew "sox"
brew "squashfs"
brew "ssh-copy-id"
brew "stern"
brew "subversion"
brew "swagger-codegen"
brew "tcpdump"
brew "terraform"
brew "tfenv", link: false
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "thrift"
brew "tig"
brew "tinyxml"
brew "tree"
brew "trivy"
brew "unzip"
brew "v8"
brew "varnish"
brew "vim", link: false
brew "vips"
brew "virtualenvwrapper"
brew "watch"
brew "wget"
brew "whois"
brew "wrk"
brew "yarn"
brew "zsh"
brew "buildkite/buildkite/bk@2"
brew "dbt-labs/dbt/dbt-postgres"
brew "heroku/brew/heroku"
brew "mongodb/brew/mongodb-community"
brew "puma/puma/puma-dev"
cask "1password", args: { appdir: "/Applications" }
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud", args: { appdir: "/Applications" }
cask "amazon-chime"
cask "amethyst", args: { appdir: "/Applications" }
cask "arc"
cask "atom", args: { appdir: "/Applications" }
cask "beeper"
cask "betterzip", args: { appdir: "/Applications" }
cask "brave-browser", args: { appdir: "/Applications" }
cask "caffeine", args: { appdir: "/Applications" }
cask "cf-terraforming"
cask "charles", args: { appdir: "/Applications" }
cask "chatgpt"
cask "chef-workstation"
cask "chefdk", args: { appdir: "/Applications" }
cask "chromedriver", args: { appdir: "/Applications" }
cask "dash", args: { appdir: "/Applications" }
cask "datagrip", args: { appdir: "/Applications" }
cask "docker", args: { appdir: "/Applications" }
cask "eclipse-java", args: { appdir: "/Applications" }
cask "element"
cask "fing"
cask "fing-cli"
cask "firefox", args: { appdir: "/Applications" }
cask "font-anonymice-powerline", args: { appdir: "/Applications" }
cask "font-consolas-for-powerline", args: { appdir: "/Applications" }
cask "font-dejavu-sans-mono-for-powerline", args: { appdir: "/Applications" }
cask "font-droid-sans-mono-for-powerline", args: { appdir: "/Applications" }
cask "font-fira-mono-for-powerline", args: { appdir: "/Applications" }
cask "font-hack-nerd-font", args: { appdir: "/Applications" }
cask "font-inconsolata-dz-for-powerline", args: { appdir: "/Applications" }
cask "font-inconsolata-for-powerline", args: { appdir: "/Applications" }
cask "font-inconsolata-g-for-powerline", args: { appdir: "/Applications" }
cask "font-liberation-mono-for-powerline", args: { appdir: "/Applications" }
cask "font-menlo-for-powerline", args: { appdir: "/Applications" }
cask "font-meslo-for-powerline", args: { appdir: "/Applications" }
cask "font-monofur-for-powerline", args: { appdir: "/Applications" }
cask "font-roboto-mono-for-powerline", args: { appdir: "/Applications" }
cask "font-source-code-pro-for-powerline", args: { appdir: "/Applications" }
cask "font-ubuntu-mono-derivative-powerline", args: { appdir: "/Applications" }
cask "gimp"
cask "github", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "google-chrome@canary", args: { appdir: "/Applications" }
cask "google-cloud-sdk", args: { appdir: "/Applications" }
cask "google-drive", args: { appdir: "/Applications" }
cask "gpg-suite", args: { appdir: "/Applications" }
cask "handbrake", args: { appdir: "/Applications" }
cask "inkscape", args: { appdir: "/Applications" }
cask "insomnia", args: { appdir: "/Applications" }
cask "intellij-idea", args: { appdir: "/Applications" }
cask "istat-menus", args: { appdir: "/Applications" }
cask "kitematic", args: { appdir: "/Applications" }
cask "kube-forwarder", args: { appdir: "/Applications" }
cask "licecap", args: { appdir: "/Applications" }
cask "linear-linear"
cask "loom"
cask "macvim"
cask "meetingbar", args: { appdir: "/Applications" }
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office", args: { appdir: "/Applications" }
cask "microsoft-teams"
cask "mysql-shell"
cask "netspot"
cask "notion", args: { appdir: "/Applications" }
cask "omnigraffle", args: { appdir: "/Applications" }
cask "openvpn-connect"
cask "parallels"
cask "paw", args: { appdir: "/Applications" }
cask "phantomjs", args: { appdir: "/Applications" }
cask "pitch"
cask "pop"
cask "pritunl", args: { appdir: "/Applications" }
cask "qbittorrent"
cask "rar"
cask "remarkable"
cask "screen-studio"
cask "signal"
cask "sketch", args: { appdir: "/Applications" }
cask "skitch", args: { appdir: "/Applications" }
cask "skype", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "sonos", args: { appdir: "/Applications" }
cask "soundflowerbed", args: { appdir: "/Applications" }
cask "sourcetree", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "switchresx", args: { appdir: "/Applications" }
cask "tailscale"
cask "telegram", args: { appdir: "/Applications" }
cask "temurin"
cask "temurin@8"
cask "transmit", args: { appdir: "/Applications" }
cask "tuple"
cask "ubiquiti-unifi-controller"
cask "vagrant", args: { appdir: "/Applications" }
cask "viscosity", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "visualvm", args: { appdir: "/Applications" }
cask "vlc", args: { appdir: "/Applications" }
cask "vmware-fusion", args: { appdir: "/Applications" }
cask "warp"
cask "whatsapp", args: { appdir: "/Applications" }
cask "wireshark"
cask "wkhtmltopdf", args: { appdir: "/Applications" }
cask "xquartz", args: { appdir: "/Applications" }
cask "xscreensaver", args: { appdir: "/Applications" }
cask "yubico-yubikey-manager", args: { appdir: "/Applications" }
cask "zed"
cask "zoom", args: { appdir: "/Applications" }
mas "1Password for Safari", id: 1569813296
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Muse", id: 1501563902
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "ban.spellright"
vscode "dart-code.dart-code"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "huacnlee.theme-macos-classic"
vscode "kodezi.kodezi"
vscode "mjmcloug.vscode-elixir"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wingrunr21.vscode-ruby"
