cask_args appdir: "/Applications"

tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

tap "buildkite/buildkite"
tap "buildkite/cli"
tap "chef/chef"
tap "cloudflare/cloudflare"
tap "codeclimate/formulae"
tap "dbt-labs/dbt"
tap "heroku/brew"
tap "instrumenta/instrumenta"
tap "mongodb/brew"
tap "puma/puma"

# Core dependencies
cask "temurin"
cask "temurin8"
cask "xquartz"

# Command line apps to install via Homebrew
brew "ack"
brew "adns"
brew "adr-tools"
brew "ansible"
brew "ansifilter"
brew "apr"
brew "apr-util"
brew "asciinema"
brew "asdf"
brew "aspell"
brew "autoconf"
brew "automake"
brew "avro-tools"
brew "awk"
brew "aws-shell"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bats"
brew "bazaar"
brew "bc"
brew "bdw-gc"
brew "berkeley-db"
brew "bfg"
brew "bfg"
brew "bison"
brew "bison@2.7"
brew "boost"
brew "boot-clj"
brew "boot2docker"
brew "brew-pip"
brew "bsdmake"
brew "buildkite/buildkite/buildkite-cli"
brew "bzip2"
brew "cabal-install"
brew "caddy"
brew "cairo"
brew "cassandra"
brew "cayley"
brew "chruby"
brew "circleci"
brew "cloc"
brew "cloog"
brew "cloudflare-wrangler2"
brew "cmake"
brew "colordiff"
brew "composer"
brew "comby"
brew "confuse"
brew "consul"
brew "container-diff"
brew "container-structure-test"
brew "coreutils"
brew "cosign"
brew "cowsay"
brew "cpanminus"
brew "crystal-lang"
brew "cscope"
brew "ctags"
brew "curl"
brew "dbt-labs/dbt/dbt-postgres"
brew "diffstat"
brew "diffutils"
brew "dos2unix"
brew "ec2-ami-tools"
brew "ec2-api-tools"
brew "ed"
brew "elasticsearch"
brew "elixir"
brew "elm"
brew "emacs"
brew "enchant"
brew "erlang"
brew "exercism"
brew "expect"
brew "faac"
brew "ffmpeg"
brew "figlet"
brew "file-formula"
brew "filebeat"
brew "findutils"
brew "flex"
brew "fltk"
brew "fontconfig"
brew "fop"
brew "fortune"
brew "freetype"
brew "fwup"
brew "gcc"
brew "gcc49"
brew "gd"
brew "gdbm"
brew "gdk-pixbuf"
brew "gdm"
brew "geckodriver"
brew "gettext"
brew "gh"
brew "ghc"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "glew"
brew "glib"
brew "glm"
brew "gmp"
brew "gnu-tar"
brew "gnu-typist"
brew "gnupg2"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "godep"
brew "gotags"
brew "gpatch"
brew "gperftools"
brew "gradle"
brew "graphicsmagick"
brew "graphite2"
brew "graphviz"
brew "grep"
brew "groff"
brew "groovy"
brew "gts"
brew "gzip"
brew "hadoop"
brew "haproxy"
brew "harfbuzz"
brew "haskell-stack"
brew "helm"
brew "heroku/brew/heroku"
brew "hiredis"
brew "htop-osx"
brew "httpie"
brew "icu4c"
brew "imagemagick"
brew "isl"
brew "jasper"
brew "jemalloc"
brew "jpeg"
brew "jpeg-turbo"
brew "jq"
brew "json-c"
brew "kafka"
brew "kcat"
brew "kops"
brew "kubernetes-cli"
brew "kubeval"
brew "lame"
brew "lbzip2"
brew "leiningen"
brew "less"
brew "libarchive"
brew "libassuan"
brew "libcroco"
brew "libevent"
brew "libffi"
brew "libgcrypt"
brew "libgit2"
brew "libgpg-error"
brew "libksba"
brew "libmagic"
brew "libmemcached"
brew "libmpc"
brew "libpng"
brew "libpqxx"
brew "librsvg"
brew "libsodium"
brew "libssh2"
brew "libtasn1"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libusb"
brew "libusb-compat"
brew "libuv"
brew "libvo-aacenc"
brew "libvterm"
brew "libxml2"
brew "libxslt"
brew "libyaml"
brew "libyubikey"
brew "links"
brew "llvm"
brew "logrotate"
brew "lsof"
brew "lua"
brew "luajit"
brew "lynx"
brew "lzo"
brew "mad"
brew "make"
brew "mas"
brew "maven"
brew "maven"
brew "mcrypt"
brew "memcached"
brew "mercurial"
brew "meson"
brew "mhash"
brew "minikube"
brew "mitmproxy"
brew "mongodb/brew/mongodb-community"
brew "mosh"
brew "mpfr"
brew "msgpack"
brew "mysql-client"
brew "nagios"
brew "nagios-plugins"
brew "nano"
brew "nasm"
brew "ncurses"
brew "neovim"
brew "netpbm"
brew "nettle"
brew "nginx"
brew "node"
brew "node"
brew "npth"
brew "nvm"
brew "oniguruma"
brew "openssl"
brew "ossp-uuid"
brew "p11-kit"
brew "p7zip"
brew "packer"
brew "pam_yubico"
brew "pango"
brew "passenger"
brew "pcre"
brew "perl"
brew "perl@5.18"
brew "pgbouncer"
brew "php"
brew "pinentry"
brew "pinentry-mac"
brew "pixman"
brew "pkg-config"
brew "pnpm"
brew "popt"
brew "postgresql"
brew "postgresql@16"
brew "proctools"
brew "protobuf"
brew "pt"
brew "pth"
brew "puma/puma/puma-dev"
brew "pv"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "python3"
brew "qemu"
brew "qt"
brew "r"
brew "rabbitmq"
brew "re2c"
brew "readline"
brew "reattach-to-user-namespace"
brew "rebar"
brew "redis"
brew "rethinkdb"
brew "rpm"
brew "rsync"
brew "ruby"
brew "ruby-install"
brew "s3cmd"
brew "sbt"
brew "scons"
brew "screen"
brew "sdl"
brew "sdl12-compat"
brew "sdl2"
brew "sdl2_image"
brew "sdl_image"
brew "serf"
brew "shared-mime-info"
brew "shellcheck"
brew "shellcheck"
brew "snappy"
brew "socat"
brew "sox"
brew "sqlite"
brew "squashfs"
brew "ssh-copy-id"
brew "stern"
brew "tcpdump"
brew "terraform"
brew "tfenv", link: false
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "thrift"
brew "tig"
brew "tinyxml"
brew "tmux"
brew "tree"
brew "unibilium"
brew "unixodbc"
brew "unzip"
brew "utf8proc"
brew "v8"
brew "varnish"
brew "vim", link: false
brew "vips"
brew "watch"
brew "webp"
brew "wget"
brew "whois"
brew "wrk"
brew "wxmac"
brew "x264"
brew "xvid"
brew "xz"
brew "yajl"
brew "yarn"
brew "ykclient"
brew "ykpers"
brew "zlib"
brew "zookeeper"
brew "zsh"

# These font casks require a subversion client
brew "subversion"
cask "font-anonymice-powerline"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-liberation-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-monofur-for-powerline"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-ubuntu-mono-derivative-powerline"

# Desktop apps to install via Cask
cask "1password"
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "amazon-chime"
cask "amethyst"
cask "arc"
cask "atom"
cask "betterzip"
cask "brave-browser"
cask "caffeine"
cask "cf-terraforming"
cask "charles"
cask "chef-workstation"
cask "chefdk"
cask "chromedriver"
cask "dash"
cask "datagrip"
cask "docker"
cask "eclipse-java"
cask "fing"
cask "fing-cli"
cask "firefox"
cask "font-hack-nerd-font"
cask "github"
cask "google-chrome"
cask "google-chrome@canary"
cask "google-cloud-sdk"
cask "google-drive"
cask "gpg-suite"
cask "handbrake"
cask "inkscape"
cask "insomnia"
cask "inspec"
cask "intellij-idea"
cask "istat-menus"
cask "kitematic"
cask "kube-forwarder"
cask "licecap"
cask "linear-linear"
cask "loom"
cask "macvim"
cask "meetingbar"
cask "microsoft-edge"
cask "microsoft-office"
cask "mysql-shell"
cask "netspot"
cask "nordvpn"
cask "notion"
cask "omnigraffle"
cask "osxfuse"
cask "paw"
cask "phantomjs"
cask "pritunl"
cask "rar"
cask "remarkable"
cask "signal"
cask "sketch"
cask "skitch"
cask "skype"
cask "slack"
cask "sonos"
cask "soundflower"
cask "soundflowerbed"
cask "sourcetree"
cask "spotify"
cask "switchresx"
cask "tailscale"
cask "telegram"
cask "transmit"
cask "vagrant"
cask "virtualbox"
cask "viscosity"
cask "visualvm"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "whatsapp"
cask "wireshark"
cask "wkhtmltopdf"
cask "xquartz"
cask "xscreensaver"
cask "yubico-yubikey-manager"
cask "zoom"

# Desktop apps to install via Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
