cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "caskroom/versions"
tap "codeclimate/formulae"
tap "gemnasium/gemnasium"
tap "fundingcircle/mortuary"
tap "homebrew/php"

# Core dependencies
cask "java"
cask "xquartz"

# Command line apps to install via Homebrew
brew "ack"
brew "adns"
brew "adr-tools"
brew "ansible"
brew "ansifilter"
brew "apr"
brew "apr-util"
brew "asciinema"
brew "asdf"
brew "aspell"
brew "autoconf"
brew "automake"
brew "avro-tools"
brew "awk"
brew "aws-shell"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bats"
brew "bazaar"
brew "bc"
brew "bdw-gc"
brew "berkeley-db"
brew "bfg"
brew "bfg"
brew "bison"
brew "bison27"
brew "boost"
brew "boost"
brew "boot-clj"
brew "boot2docker"
brew "brew-pip"
brew "bsdmake"
brew "bzip2"
brew "cabal-install"
brew "cairo"
brew "cassandra"
brew "cassandra12"
brew "cayley"
brew "chromedriver"
brew "chruby"
brew "cloc"
brew "cloog"
brew "cloog018"
brew "cmake"
brew "colordiff"
brew "composer"
brew "confuse"
brew "consul"
brew "coreutils"
brew "cowsay"
brew "cpanminus"
brew "crystal-lang"
brew "cscope"
brew "ctags"
brew "curl"
brew "diffstat"
brew "diffutils"
brew "dirmngr"
brew "dos2unix"
brew "ec2-ami-tools"
brew "ec2-api-tools"
brew "ed"
brew "elasticsearch"
brew "elixir"
brew "elm"
brew "emacs", args: ["with-cocoa", "with-gnutls"]
brew "enchant"
brew "erlang"
brew "exercism"
brew "expect"
brew "faac"
brew "ffmpeg"
brew "ffmpeg"
brew "figlet"
brew "file-formula"
brew "filebeat"
brew "findutils"
brew "flex"
brew "fltk"
brew "fontconfig"
brew "fortune"
brew "freetype"
brew "fwup"
brew "gcc"
brew "gcc48"
brew "gd"
brew "gdbm"
brew "gdk-pixbuf"
brew "gdm"
brew "gemnasium-toolbelt"
brew "gettext"
brew "ghc"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "glew"
brew "glib"
brew "glm"
brew "gmp"
brew "gmp4"
brew "gnu-tar"
brew "gnu-typist"
brew "gnupg2"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "godep"
brew "google-perftools"
brew "gotags"
brew "gpatch"
brew "gperftools"
brew "gpg-agent"
brew "gradle"
brew "graphicsmagick"
brew "graphite2"
brew "graphviz"
brew "grep"
brew "groff"
brew "groovy"
brew "gts"
brew "gzip"
brew "hadoop"
brew "haproxy"
brew "harfbuzz"
brew "haskell-stack"
brew "heroku"
brew "heroku-toolbelt"
brew "hiredis"
brew "htop-osx"
brew "httpie"
brew "icu4c"
brew "igbinary"
brew "imagemagick"
brew "isl"
brew "isl011"
brew "jasper"
brew "jemalloc"
brew "jpeg"
brew "jpeg-turbo"
brew "jq"
brew "json-c"
brew "kafka"
brew "kafkacat"
brew "kops"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "lame"
brew "lbzip2"
brew "leiningen"
brew "less"
brew "libarchive"
brew "libassuan"
brew "libcroco"
brew "libevent"
brew "libffi"
brew "libgcrypt"
brew "libgit2"
brew "libgpg-error"
brew "libksba"
brew "libmagic"
brew "libmemcached"
brew "libmpc"
brew "libmpc08"
brew "libpng"
brew "libpqxx"
brew "librsvg"
brew "libsodium"
brew "libssh2"
brew "libtasn1"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libusb"
brew "libusb-compat"
brew "libuv"
brew "libvo-aacenc"
brew "libvterm"
brew "libxml2"
brew "libxslt"
brew "libyaml"
brew "libyubikey"
brew "links"
brew "llvm"
brew "logrotate"
brew "lsof"
brew "lua"
brew "luajit"
brew "lynx"
brew "lzo"
brew "macvim"
brew "mad"
brew "make"
brew "mas"
brew "maven"
brew "maven"
brew "mcrypt"
brew "md5sha1sum"
brew "memcached"
brew "mercurial"
brew "mhash"
brew "minimesos"
brew "mitmproxy"
brew "mongodb"
brew "mpfr"
brew "mpfr2"
brew "msgpack"
brew "mysql-connector-c"
brew "nagios"
brew "nagios-plugins"
brew "nano"
brew "nasm"
brew "ncurses"
brew "neovim"
brew "netpbm"
brew "nettle"
brew "nginx"
brew "node"
brew "node"
brew "npth"
brew "nvm"
brew "oniguruma"
brew "openssl"
brew "ossp-uuid"
brew "p11-kit"
brew "p7zip"
brew "packer"
brew "pam_yubico"
brew "pango"
brew "passenger"
brew "pcre"
brew "perl"
brew "perl@5.18"
brew "phantomjs"
brew "php54"
brew "php54-igbinary"
brew "php54-memcache"
brew "php54-memcached"
brew "php56"
brew "php56-mongo"
brew "php70"
brew "php71"
brew "pinentry"
brew "pinentry-mac"
brew "pixman"
brew "pkg-config"
brew "popt"
brew "postgresql"
brew "postgresql92"
brew "proctools"
brew "protobuf"
brew "pt"
brew "pth"
brew "pv"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "python3"
brew "qemu"
brew "qt"
brew "qt@5.5"
brew "r"
brew "rabbitmq"
brew "re2c"
brew "readline"
brew "reattach-to-user-namespace"
brew "rebar"
brew "redis"
brew "rethinkdb"
brew "rpm"
brew "rpm2cpio"
brew "rsync"
brew "ruby"
brew "ruby-install"
brew "sbt"
brew "scons"
brew "screen"
brew "sdl"
brew "sdl2"
brew "sdl2_image"
brew "sdl_image"
brew "serf"
brew "shared-mime-info"
brew "shellcheck"
brew "shellcheck"
brew "snappy"
brew "socat"
brew "sox"
brew "sqlite"
brew "sqlite"
brew "squashfs"
brew "ssh-copy-id"
brew "tcpdump"
brew "terraform"
brew "tfenv"
brew "the_silver_searcher"
brew "thrift"
brew "thrift"
brew "tig"
brew "tinyxml"
brew "tmux"
brew "tree"
brew "unibilium"
brew "unixodbc"
brew "unrar"
brew "unzip"
brew "utf8proc"
brew "v8"
brew "varnish"
brew "vim", args: ["with-client-server", "with-luajit"]
brew "watch"
brew "webp"
brew "wget", args: ["with-gpgme"]
brew "whois"
brew "wxmac"
brew "x264"
brew "xctool"
brew "xvid"
brew "xz"
brew "yajl"
brew "yarn"
brew "ykclient"
brew "ykpers"
brew "zlib"
brew "zookeeper"
brew "zsh"

# Desktop apps to install via Cask
cask "adobe-creative-cloud"
cask "atom"
cask "betterzip"
cask "caffeine"
cask "charles"
cask "chefdk"
cask "consul-cli"
cask "dash"
cask "datagrip"
cask "docker"
cask "eclipse-java"
cask "firefox"
cask "github-desktop"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-cloud-sdk"
cask "google-drive"
cask "handbrake"
cask "inkscape"
cask "insomnia"
cask "intellij-idea"
cask "istat-menus"
cask "kitematic"
cask "licecap"
cask "microsoft-office"
cask "minikube"
cask "osxfuse"
cask "pritunl"
cask "r"
cask "screenhero"
cask "sketch"
cask "skype"
cask "sourcetree"
cask "spectacle"
cask "switchresx"
cask "toggldesktop"
cask "transmit"
cask "vagrant"
cask "virtualbox"
cask "viscosity"
cask "visualvm"
cask "vmware-fusion"
cask "wkhtmltopdf"
cask "yubikey-neo-manager"
cask "zoomus"

brew "codeclimate" # Requires docker to be installed :\

# Desktop apps to install via Mac App Store
mas "1Password", id: 443987910
mas "LastPass", id: 926036361
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 715768417
# mas "Navicat Essentials for MySQL", id: 466415644
# mas "Navicat Essentials for PostgreSQL", id: 466725643
mas "Numbers", id: 409203825
mas "Omnigraffle 7", id: 1142578753
mas "Pages", id: 409201541
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
